/* задание 1 */
/* У вас есть большой текст, в котором для обозначения диалогов 
используются одинарные кавычки. Придумать шаблон, который меняет 
одинарные кавычки на двойные. */
let str_1 = "'Привет, как твои дела?', спросил Миша. На что Анна ответила: 'Не плохо, спасибо. С регулярками вот разбираюсь'";
// console.log(str_1);
// let template_1 = /(').+?(')/;
// console.log(template_1.exec(str_1));
// let str_find = template_1.exec(str_1)[1];
// console.log('str_find = :', str_find.length);

// str_1 = str_1.replace(str_find, "\"");
// console.log(str_1);


/* не смог сделать, буду пробовать ещё */
